_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lstm_1 (LSTM)                (1, 5, 12)                1152      
_________________________________________________________________
lstm_2 (LSTM)                (1, 5, 12)                1200      
_________________________________________________________________
dropout_1 (Dropout)          (1, 5, 12)                0         
_________________________________________________________________
lstm_3 (LSTM)                (1, 5, 12)                1200      
_________________________________________________________________
dropout_2 (Dropout)          (1, 5, 12)                0         
_________________________________________________________________
dense_1 (Dense)              (1, 5, 8)                 104       
_________________________________________________________________
dense_2 (Dense)              (1, 5, 4)                 36        
=================================================================
Total params: 3,692
Trainable params: 3,692
Non-trainable params: 0
_________________________________________________________________
None

Fold 0